jssmile/SmartScooter_stm32/main.c
/* Includes ------------------------------------------------------------------*/

#include "FreeRTOS.h"
#include "task.h"
//#include "usbd_hid_core.h"
//#include "usbd_usr.h"
//#include "usbd_desc.h"

#include "main.h"
#include "stm32f4xx_conf.h"
#include "usart.h"
#include "queue.h"
#include "semphr.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define TESTRESULT_ADDRESS         0x080FFFFC
#define ALLTEST_PASS               0x00000000
#define ALLTEST_FAIL               0x55555555
#define ADC1_DR_Address   ((uint32_t)0x4001204C)

/* PWM Timer mapping */
//#define PWM1 (TIM2 -> CCR3)
#define PWM1 (TIM12 -> CCR1)  // right of the front
#define PWM2 (TIM12 -> CCR2)
#define PWM3 (TIM10 -> CCR1)
#define PWM4 (TIM11 -> CCR1)
#define PWM5 (TIM4 -> CCR1)  // center of the front
#define PWM6 (TIM4 -> CCR2)
#define PWM7 (TIM3 -> CCR3)
#define PWM8 (TIM3 -> CCR4)
#define PWM9 (TIM9 -> CCR2)  // left of the front
#define DegreeShift 0         // Use this value to set the angle of lidar

__IO uint32_t TimingDelay = 0;
__IO uint8_t UserButtonPressed = 0x00;

__IO uint64_t currentTime = 0;
__IO uint64_t oldTime = 0;
__IO uint64_t Timing = 0;
__IO uint32_t diffTime = 0;
__IO uint64_t Velocity = 0;
volatile int over_flag = 0;
volatile int btFlag = 0;

/* Lidar (Usart) -------------------------------------------------------------*/
//const int front_obstacle_region[90] = {500, 500, 500, 501, 501, 502, 503, 504, 505, 506, 508, 509, 511, 513, 515, 518, 520, 523, 526, 529, 532, 536, 539, 543, 547, 552, 556, 561, 566, 572, 577, 583, 590, 596, 603, 610, 618, 626, 635, 643, 653, 663, 673, 684, 695, 707, 720, 733, 747, 762, 778, 795, 812, 831, 851, 872, 894, 918, 944, 971, 1000, 1031, 1065, 1101, 1141, 1183, 1229, 1280, 1335, 1395, 1462, 1536, 1618, 1710, 1814, 1932, 2067, 2223, 2405, 2620, 2879, 3196, 3593, 4103, 4783, 5737, 7168, 9554, 14327, 28649};
const int sin_array[90] = {0, 17, 35, 53, 71, 89, 107, 124, 142, 160, 177, 195, 212, 230, 247, 265, 282, 299, 316, 333, 350, 366, 383, 400, 416, 432, 448, 464, 480, 496, 511, 527, 542, 557, 572, 587, 601, 616, 630, 644, 658, 671, 685, 698, 711, 724, 736, 748, 760, 772, 784, 795, 806, 817, 828, 838, 848, 858, 868, 877, 886, 895, 904, 912, 920, 928, 935, 942, 949, 955, 962, 968, 973, 979, 984, 989, 993, 997, 1001, 1005, 1008, 1011, 1014, 1016, 1018, 1020, 1021, 1022, 1023, 1023};
static uint8_t aRxBuffer = 0;
int16_t degree_distance[180] = {0};    /* Use this array to store distance information of front 180 degree */
int min_distance[9] = {0};
int check_sum(void);
int check_index(unsigned int);
void reset_tmp(void);
volatile uint32_t v_tmp = 0;
uint16_t distance_convert(uint8_t data0, uint8_t data1);
struct lidarData {
  uint8_t data[16];     /* Store the data of 4 angles */
  uint64_t time_stamp[2];  /* Use this to check update time */
};
volatile struct lidarData lidarBuffer[LidarPacketNumber];
/* Lidar (Usart) -------------------------------------------------------------*/
int front_region_right[5] = {6000};
int front_region_left[5] = {6000};
int front_region[9] = {6000};
volatile int handler_count = 0; 
/**
  * @brief  Use this task to check wethrer the FreeRTOS scheduling is working.
  * @param  None
  * @retval None
  */
static void LED_task(void *pvParameters)
{
  STM_EVAL_LEDInit(LED3);
  STM_EVAL_LEDInit(LED4);
  STM_EVAL_LEDInit(LED5);
  
  while(1)
  {    
      /* Toggle LED5 */
      STM_EVAL_LEDToggle(LED3);
      vTaskDelay(100);
      STM_EVAL_LEDToggle(LED4);
      vTaskDelay(100);
      STM_EVAL_LEDToggle(LED5);
      vTaskDelay(100);
  }
}

/**
  * @brief  Use this task to read and check the data sent from Lidar.
  * @param  None
  * @retval None
  */
static void usart_receive_task(void *pvParameters){
  //int tmp_index;
  //LCD_Clear(LCD_COLOR_WHITE);
  //LCD_SetBackColor(LCD_COLOR_WHITE);
  
  while(1){
    /* Enable the Rx interrupt */
    USART_ITConfig(USARTx, USART_IT_RXNE, ENABLE);
    
    /* Waiting the end of Data transfer  */ 
    while(current_received_byte < LidarPacketSize);
    
    /* disable USART interrupt */
      NVIC_DisableIRQ(USARTx_IRQn);
        
    if(check_index(current_packet[1]) & check_sum()){
      write_packet();
    }
    reset_tmp();
    vTaskDelay(1);
  }
}

/**
  * @brief  This task used to calculated how much time the data was changed in each index
  * @param  None
  * @retval None
  */
static void lidar_display_task(void *pvParameters){
  //int tmp_index;
  int changed_count = 0;
  int index_count = 0;
  int tmp_array [200];
  int index_statistic [90] = {0};
  
  while(1){
    while(tmp_array[changed_count-1] == current_packet[1]);
      
    tmp_array[changed_count++] = current_packet[1];
    index_statistic[current_packet[1]-160]++; 
    
    if(changed_count == 199){
      while(index_count < 90){
        //printf("%d,", index_statistic[index_count]);
        index_count++;
      }
      index_count = 0;
      changed_count = 0;
    }
    vTaskDelay(1);
  }
}

/**
  * @brief  This task used to write distance data of each degree to the buffer
  * @param  None
  * @retval None
  */
static void Transfer_Distance_task(void *pvParameters){
  int count = 0;
  uint16_t distance_angle1 = 0;
  uint16_t distance_angle2 = 0;
  uint16_t distance_angle3 = 0;
  uint16_t distance_angle4 = 0;

  while(1){
    for(count = 0; count < 45; count++){
      //if(distance_convert(lidarBuffer[count].data[0], lidarBuffer[count].data[1]) != -1){
        distance_angle1 = distance_convert(lidarBuffer[count].data[0], lidarBuffer[count].data[1]);
      //}
      //printf("A: %d D: %d \n", count * 4, distance_angle1);

      //if(distance_convert(lidarBuffer[count].data[4], lidarBuffer[count].data[5]) != -1){
        distance_angle2 = distance_convert(lidarBuffer[count].data[4], lidarBuffer[count].data[5]);
      //}
      //printf("A: %d D: %d \n", count * 4 + 1, distance_angle2);
      
      //if(distance_convert(lidarBuffer[count].data[8], lidarBuffer[count].data[9]) != -1){
        distance_angle3 = distance_convert(lidarBuffer[count].data[8], lidarBuffer[count].data[9]);
      //}
      //printf("A: %d D: %d \n", count * 4 + 1, distance_angle3);
      
      //if(distance_convert(lidarBuffer[count].data[12], lidarBuffer[count].data[13]) != -1){
        distance_angle4 = distance_convert(lidarBuffer[count].data[12], lidarBuffer[count].data[13]);
      //}
      //printf("A: %d D: %d \n", count * 4 + 1, distance_angle4);
      
