jssmile/SmartScooter_stm32/main.c
      /* Write data to distance array */
      degree_distance[count*4] = distance_angle1;
      degree_distance[count*4 + 1] = distance_angle2;
      degree_distance[count*4 + 2] = distance_angle3;
      degree_distance[count*4 + 3] = distance_angle4;
    }
    vTaskDelay(30);
  }
}

/**
  * @brief  Use this task to detect the front obstacle
  * @param  None
  * @retval None
  */
static void Front_Obstacle_task(void *pvParameters){
  int count, i;
  int tmp_degree;
  int16_t x_position;
  int tmp_count = 0;
  char current_status ='F'; // F : safe 
  char safe_message[9] = {'o', 'n', 'm', 'l', 'k', 'j', 'i', 'h', 'g'};
  char alarm_message[9] = {'O', 'N', 'M', 'L', 'K', 'J', 'I', 'H', 'G'};
  int range_alarm_distance[9] = {500,600,800,1500,3200,1500,800,600,500};
  int range_size = 19; //19
  int range_number = 9;

  while(1){
    long range_distance[9] = {0};
    long valid_distance[9] = {range_size};
    int tmp_count, tmp_count2 = 0;
    current_status = 'F';

    for(tmp_count = 0; tmp_count < range_size; tmp_count++){
      for(tmp_count2 = 0; tmp_count2 < range_number; tmp_count2++){
        if(degree_distance[tmp_count2*range_size + tmp_count] > 0){
          range_distance[tmp_count2] += degree_distance[tmp_count2*range_size + tmp_count];
        } else{
          valid_distance[tmp_count2] --;
        }
      }
    }

    // Get the average distance from 9 direction 
    int range_count = 0;
    for (range_count = 0; range_count < range_number; range_count++){
      range_distance[range_count] = range_distance[range_count]/valid_distance[range_count];
    }

    // There is a obstacle in front of the scooter. send 'A'
    for (range_count = 0; range_count < range_number; range_count++){
      if (range_distance[range_count] < range_alarm_distance[range_count]){
        current_status = 'A';
        sendDirectionMessage(alarm_message[range_count]);
      } else{
        sendDirectionMessage(safe_message[range_count]);
      }
    }

    put_int(range_distance[4]);
    put_int(valid_distance[4]);

    if(btFlag == 0){
      while(USART_GetFlagStatus(USARTy, USART_FLAG_TXE) == RESET);
      USART_SendData(USARTy, current_status);
    }
    vTaskDelay(100);
  }
}



void sendDirectionMessage(char c){
  if(btFlag == 0){
    while(USART_GetFlagStatus(USARTy, USART_FLAG_TXE) == RESET);
    USART_SendData(USARTy, c);
  }
  vTaskDelay(10);
}

static void external_interrupt_task(void *pvParameters){
  PWM1 = 0;
  
  while(1){
    v_tmp = ((1000*1000/diffTime)*(3600/1000)) / 1000;
    if (v_tmp >= 0 && v_tmp < 30)
    {
      //put_int(v_tmp);
    }
    vTaskDelay(500);
  }
}

void put_int(uint32_t number){
  btFlag = 1;
  unsigned char char_buff[10] = {0};
  int count = 0;
  
  /* Trnasfer integer to chars */
  itoa(number, char_buff, 10);
  
  while(USART_GetFlagStatus(USARTy, USART_FLAG_TXE) == RESET);
    USART_SendData(USARTy, 'S');

  vTaskDelay(1);

  /* Send the char buffer to usart */
  while(count < 2){
    while(USART_GetFlagStatus(USARTy, USART_FLAG_TXE) == RESET);
    USART_SendData(USARTy, char_buff[count]);
    count ++;
  }

  vTaskDelay(1);
  while(USART_GetFlagStatus(USARTy, USART_FLAG_TXE) == RESET);
    USART_SendData(USARTy, 'E');

  vTaskDelay(1);
  btFlag = 0;
}

/**
  * @brief  Use this function to check index of receive data is in the range of correct index number.
  * @param  None
  * @retval None
  */
int check_index(unsigned int index){
  if(index >= 0xA0 && index < 0xFA){ 
    return 1;
  }
  else{ 
    return 0;
  }
}

/**
  * @brief  Use this function to check the packets are correct.
  * @param  None
  * @retval None
  */
int check_sum(){
  int count;
  int transfer;
  long check32 = 0;
  long checksum;
  long received_checksum;

  for (count = 0; count < 10; count++){
    transfer = current_packet[2 * count] + ((int)current_packet[2 * count + 1] << 8);
    check32 = (check32 << 1) + transfer;
  }

  checksum = (check32 & 0x7FFF) + (check32 >> 15);
  checksum = checksum & 0x7FFF;
  received_checksum = current_packet[20] + ((int)current_packet[21] << 8);
  
  if (checksum == received_checksum){
    return 1;
  }
  else{
    return 0;
  }
}

/**
  * @brief  This function write the correct data to lidarBuffer.
  * @param  None
  * @retval None
  */
void write_packet(){
  int count = 0;
  int index = current_packet[1] - 160/* index start from (A0)16 = (160)(10)*/;

  for(; count < 16; count++){
    lidarBuffer[index].data[count] = current_packet[count];
  }
  writed_packet_num ++;
  //PWM5 = (writed_packet_num/100);  // check for receive data
}

/**
  * @brief  This function reset the flags and counts, and reenable the Interrrupt of Usart.
  * @param  None
  * @retval None
  */
void reset_tmp(){
  /* enable USART interrupt */
  NVIC_EnableIRQ(USARTx_IRQn);
  
  current_received_byte = 0;
  started_flag = 0;
}

/**
  * @brief  This function convert the distance data from byte format.
  * @param  None
  * @retval None
  */
uint16_t distance_convert(uint8_t data0, uint8_t data1){
  uint16_t distance_data = ((0x00FF & data1) << 8) | data0;
  
  if ((distance_data & 0x8000) == 0x8000){
    //return 6000;/*if the data is invalid, return the maximum value.*/
    return -1;
  }
  else{
    return distance_data & 0x3FFF;
  }
}

/**
  * @brief  This function handles EXTI0_IRQ Handler.
  * @param  None
  * @retval None
  */
void EXTI0_IRQHandler(void)
{
  /* Clear the EXTI line pending bit */
  EXTI_ClearITPendingBit(USER_BUTTON_EXTI_LINE);
  if(UserButtonPressed){
    UserButtonPressed = 0x00;
  }else
    UserButtonPressed = 0x01;

}

void USARTx_IRQHandler(void)
{
  /* USART in Receiver mode */
  if ((USART_GetITStatus(USARTx, USART_IT_RXNE) == SET))
  {
    /* Receive the data */
    aRxBuffer = USART_ReceiveData(USARTx);
    //printf("%d ", aRxBuffer);
    
    if(aRxBuffer == 250/* FA(HEX) = 250(DEC) */){
      started_flag = 1;
    }

    /* after received start byte, storing the data to current_packet[] */
    if(started_flag == 1 && (current_received_byte < LidarPacketSize)){
      current_packet[current_received_byte] = aRxBuffer;
      current_received_byte ++;
    }
  }
}

int main(void)
{
  RCC_ClocksTypeDef RCC_Clocks;
  
